{
  "sitesParagraph1":"SunnieJS 3 es un entorno <span class='text-primary'>multisite</span>, esto quiere decir que en un solo entorno somos capaces de gestionar varios portales web simultáneamente, cada uno con sus propias <span class='text-primary'><span class='text-primary'>características</span> y <span class='text-primary'>configuraciones</span>.",
  "sitesParagraph2":"Cada uno de los sites esta compuesto por diferentes <span class='text-primary'>páginas</span> y estas, a su vez, se rellenan con <span class='text-primary'>componentes</span> colocados a partir de la distribución definida por una <span class='text-primary'>layout</span>. Adicionalmente, cada site tiene asociado un <span class='text-primary'>tema de apariencia</span> que es el que le da su estilo y estructura global.",
  "sitesParagraph3":"Para ello, cada site dispone de un archivo <span class='text-primary'>sitemap.json</span> donde se van definiendo todas las configuraciones del site. Por supuesto, no es necesario gestionarlo manualmente sino que a través de las <span class='text-primary'>herramientas de CMS</span> se puede gestionar de forma automatizada para <span class='text-primary'>añadir páginas</span>, moverlas de sitio en el arbol de navegación, gestionar los componentes que las forman, su tema de apariencia o la layout que usa cada página.",
  "sitesParagraph4":"Si lo prefieres, también puedes editar el sitemap manualmente pero no te olvides luego de compilar el site para que tus cambios se vean reflejados en el navegador. Te recomendamos no editar a mano el sitemap ya que puede ser complejo y es fácil cometer algún error en la sintaxis o el formato.",
  "sitesParagraph5":"A partir del sitemap, se puede indicar para cada página los <span class='text-primary'>componentes</span> que incluye, su <span class='text-primary'>configuración</span>, en que posición van, cuáles son los <span class='text-primary'>metadatos</span> de la página y mucho más!",
  "sitesParagraph6":"Ejemplo de Sitemap",
  "sitesParagraph7":"El objeto <span class='text-primary'>site</span> define tanto el <span class='text-primary'>nombre</span> del site como la <span class='text-primary'>URL</span> con la que accederemos.",
  "sitesParagraph8":"El objeto <span class='text-primary'>pages</span> define todas las páginas de que dispone el site asi como su <span class='text-primary'>configuración</span>."
}