{
  "pageTitle":"Get Started",
  "paragraph1":"SunnieJS is available for download through the git repository <a href='https://github.com/SergioGB-work/sunnie' target='_blank' rel='noreferrer'>https://github.com/SergioGB-work/SunnieJS</a>",
  "paragraph2":"We recommend you download the <span class='text-primary'>latest release available</span> from version 3 (release/3.X.X)",
  "installationTitle":"Installation",
  "installationParagraph1":"The first thing to do once you have downloaded the code on a folder is <span class='text-primary'>install the project</span>. Being a project type <span class='text-primary'>npm</span>, all you have to do is run from the <span class='text-primary'>administration console(CMD)</span>, locating you on the project folder:",
  "installationParagraph2":"Once you have finished the installation you will be ready to start working with SunnieJS.",
  "initServerTitle":"Running the Server",
  "initServerParagraph1":"SunnieJS is built based on <span class='text-primary'>Gulp</span> for task automation and <span class='text-primary'>Node</span> for package management and server Applications.",
  "initServerParagraph2":"If you want <span class='text-primary'>to start</span> the <span class='text-primary'>server</span> you just have to execute the following command:",
  "initServerParagraph3":"This task will compile the project and will raise two local servers, one for production and the other one for development, on the urls <span class='text-primary'>http://localhost:8080/default/en</span> and <span class='text-primary'>http://localhost:8083/default/en</span>",
  "initServerParagraph4":"Thanks to Gulp, SunnieJS has a series of automated tasks that allow us to perform the different compilation operations in a very simple way.",
  "initServerParagraph5":"The structure of all the tasks that we will launch from CMD is <span class='text-primary'>gulp nombreTarea</span> where name task will be the name of the gulp task that we already have pre-created to compile, for example, the CSS or JS of our project.",
  "initServerParagraph6":"Below is the main list of <span class = 'text-primary'> tasks available </ span>:",
  "initServerTableTH1":"Task name",
  "initServerTableTH2":"Description",
  "initServerTableTH3":"How to",
  "initServerTableContainerDeployDescription":"General compilation task. Make a complete compilation of the project, including all its files: JS, CSS, HTML, etc...",
  "initServerTableContainerDeployCSSDescription":"Compile only the CSS of the project, transforming the SASS into clean and minified CSS code",
  "initServerTableContainerDeployJSDescription":"Compile only the JS of the project, transforming the javascript into clean and minified js code",
  "initServerTableContainerDeployPUGDescription":"Compile only the PUG of the project, transforming the pug into clean HTML code and applying the internationalization of variables if there is one.",
  "initServerParagraph7":"The objective of the previous tasks is to <span class='text-primary'>streamline the work</span> of any developer by allowing them to compile only one part of the project, which entails a much shorter time of <span class='text-primary'>compilation</span> and a greater <span class='text-primary'>agility</span> of development.",
  "structureProjectTitle":"Project Structure",
  "structureProjectParagraph1":"Every project developed with SunnieJS has a similar and predefined structure.",
  
  "componentsParagraph1":"The components folder contains all the components created in the portal for use in the pages. Each component is created based on the same structure and all the details of it can be seen in the <a href='./components.html' title='Ir a Componentes'>components section</a> of this portal.",
  "layoutsParagraph1":"The layouts folder contains all the layouts created in the portal for use when defining the distribution of the content of a page. Each layout is created based on the same structure and all the detail of it can be seen in the <a href='./layouts.html' title='Ir a Layouts'>section of layouts</a> of this portal.",
  "fragmentsParagraph1":"A fragment is a <span class = 'text-primary'>piece of reusable code</span> between different components. For example, a button. In this folder you must create the different fragments that will be used in the portal."
}