{
  "pageTitle":"Get Started",
  "paragraph1":"SunnieJS está disponible para su descarga a través del repositorio de git <a href='https://github.com/SergioGB-work/sunnie' target='_blank' rel='noreferrer'>https://github.com/SergioGB-work/SunnieJS</a>.",
  "paragraph2":"Os recomendamos descargar la <span class='text-primary'>última release disponible</span> de la versión 3 (release/3.X.X)",
  "installationTitle":"Instalación",
  "installationParagraph1":"Lo primero que debes hacer una vez descargado el código sobre una carpeta es <span class='text-primary'>instalar el proyecto</span>. AL ser un proyecto tipo <span class='text-primary'>npm</span> lo único que debes hacer es ejecutar desde la <span class='text-primary'>consola de administración(CMD)</span>, situándote sobre la carpeta del proyecto:",
  "installationParagraph2":"Una vez haya terminado la instalación ya estarás preparado para comenzar a trabajar con SunnieJS.",
  "initServerTitle":"Arrancando el Servidor",
  "initServerParagraph1":"SunnieJS esta construido en base a <span class='text-primary'>Gulp</span> para la automatización de tareas y <span class='text-primary'>Node</span> para la gestión de paquetes y servidor de aplicaciones.",
  "initServerParagraph2":"Si deseas <span class='text-primary'>arrancar</span> el <span class='text-primary'>servidor</span> tan solo debes ejecutar el siguiente comando:",
  "initServerParagraph3":"Esta tarea compilará el proyecto y levantará dos servidores locales, uno de producción y otro de desarrollo, sobre las urls <span class='text-primary'>http://localhost:8080/default/es</span> y <span class='text-primary'>http://localhost:8083/default/es</span>",
  "initServerParagraph4":"Gracias a Gulp, SunnieJS dispone de una serie de tareas automatizadas que nos permiten realizar las diferentes operaciones de compilación de una manera muy simple.",
  "initServerParagraph5":"La estructura de todas las tareas que lanzaremos desde CMD es <span class='text-primary'>gulp nombreTarea</span> donde nombre tarea será el nombre de la tarea gulp que ya tenemos precreada para compilara, por ejemplo, el CSS o JS de nuestro proyecto.",
  "initServerParagraph6":"A continuación se muestra el listado principal de <span class='text-primary'>tareas disponibles</span>:",
  "initServerTableTH1":"Nombre Tarea",
  "initServerTableTH2":"Descripción",
  "initServerTableTH3":"Uso",
  "initServerTableContainerDeployDescription":"Tarea general de compilación. Realiza una compilación completa del proyecto, incluyendo todos sus archivos: JS, CSS, HTML, etc...",
  "initServerTableContainerDeployCSSDescription":"Compila sólo el CSS del proyecto, transformando el SASS en código CSS limpio y minificado",
  "initServerTableContainerDeployJSDescription":"Compila sólo el JS del proyecto, transformando el javascript en código js limpio y minificado",
  "initServerTableContainerDeployPUGDescription":"Compila solo el PUG del proyecto, transformando el pug en código HTML limpio y aplicando la internacionalización de variables si es que la hubiese.",
  "initServerParagraph7":"El objetivo de las tareas anteriores es <span class='text-primary'>agilizar el trabajo</span> de cualquier desarrollador permitiendole compilar solo una parte del proyecto lo que conlleva un tiempo mucho menor de <span class='text-primary'>compilación</span> y una mayor <span class='text-primary'>agilidad</span> de desarrollo.",
  "structureProjectTitle":"Estructura de proyecto",
  "structureProjectParagraph1":"Todo proyecto desarrollado con SunnieJS tiene una estructura similar y prefijada.",
  "componentsParagraph1":"La carpeta componentes contiene todos los componentes creados en el portal para su uso en las páginas. Cada componente se crea en base a una misma estructura y todo el detalle del mismo se puede ver en la <a href='./components.html' title='Ir a Componentes'>sección de componentes</a> de este portal.",
  "layoutsParagraph1":"La carpeta layouts contiene todas las layouts creadas en el portal para su uso a la hora de definir la distribución del contenido de una página. Cada layout se crea en base a una misma estructura y todo el detalle de la misma se puede ver en la <a href='./layouts.html' title='Ir a Layouts'>sección de layouts</a> de este portal.",
  "fragmentsParagraph1":"Un fragment es un <span class='text-primary'>trozo de código reutilizable</span> entre diferentes componentes. Por ejemplo, un botón. En esta carpeta se deben crear lo diferentes fragmentos que se vayan a utilizar en el portal."
}