{
  "pageTitle":"Get Started",
  "cssParagraph1":"La carpeta css contiene todos los estilos genéricos del portal. SunnieJS ya dispone de una serie de estilo predefinidos que el desarrollador debe adaptar al estilo final de cada portal.",
  "cssParagraph2":"SunnieJS utiliza <span class='text-primary'>Bootstrap 4</span> como base para la organización y maquetado de todo su portal. Es por ello que se recomienda modificar lo menos posible los estilos por defecto que trae SunnieJS y extender a partir de los mismos desde el archivo <span class='text-primary'>custom.scss</span>",
  "cssParagraph3":"Adicionalmente, desde <span class='text-primary'>base/variables</span> están todas las <span class='text-primary'>variables genéricas</span> del portal que pueden ser usadas para modificar su estilo sin necesidad de modificar ninguna línea de código, consiguiendo asi un <span class='text-primary'>código limpio y reducido</span>, que penalice lo menos posible la carga del portal.",
  "cssParagraph4":"SunnieJS lleva incorporado la fuente icónica <a href='http://fontawesome.io/icons/'' target='_blank' title='Ir a Font Awesome' rel='noreferrer'>Font Awesome</a> para su uso dentro del portal. Asi mismo, se puede utilizar cualquier otra fuente icónica.",
  "javascriptParagraph1":"El directorio de javascript está subdividido a su vez en otros directorios, cada uno con un fin específico.",
  "javascriptList11":"Son librerias que deben ser cargadas las primeras debido a que otras librerias pueden tener dependencias con ellas. Por ejemplo: jQuery",
  "javascriptList12":"Son las librerías genericas del portal.",
  "javascriptList13":"Son librerias o código JS que debe ejecutarse en la carga inicial del portal desde el <span class='text-primary'>head</span>, sin esperar por nada. Están escritas en javascript puro",
  "javascriptList14":"Archivo principal de javascript. Contiene todas las funciones genéricas del portal definidas en la <a href='./js-functions.html' title='Ir a JS Functions'>página de javascript</a>.",
  "javascriptParagraph2":"Por norma general, cuando desees añadir una nueva librería, deberás añadirla en la carpeta libs.",
  "javascriptParagraph3":"No es necesario añadir la etiqueta <span class='text-primary'>&lt;script&gt;</span> en la cabecera o pie del portal ya que SunnieJS <span class='text-primary'>compila</span> automáticamente las librerias que se encuentran en estas carpetas en un orden para luego generar un único <span class='text-primary'>archivo javascript minificado</span> con todo el código.",
  "imagesParagraph1":"Esta carpeta sirve como almacén de imágenes. Todas las imágenes aquí añadidas pasarán directamente a la carpeta <span class='text-primary'>public</span> dentro de su correspondiente carpeta de images."
}